FKDD_COPY_DIFF_3_2026-02-13/ChartsOfCharacteristicTypes/НазначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>НазначенияСвойствОбъектов</Name>
			<Comment>Каждый элемент справочника определяет набор видов свойств для конкретного вида объекта или самого объекта</Comment>
			<Type>
				<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводОстатковПрочихАктивов</v8:Type>
				<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
				<v8:Type>cfg:DocumentRef.ВыплатаЗарплаты</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаменаВЗаказеПоставщику</v8:Type>
				<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
				<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыКузовов</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
				<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаменаВЗаказеПокупателя</v8:Type>
				<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.БТ_ПредоплаченноеТО</v8:Type>
				<v8:Type>cfg:DocumentRef.Корректировка</v8:Type>
				<v8:Type>cfg:DocumentRef.СписаниеАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
				<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
				<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
				<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
				<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
				<v8:Type>cfg:CatalogRef.Модели</v8:Type>
				<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
				<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.РабочийЛист</v8:Type>
				<v8:Type>cfg:DocumentRef.РабочийЛистКредитногоОтдела</v8:Type>
				<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводОстатковАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ИзменениеЦенАвторабот</v8:Type>
				<v8:Type>cfg:DocumentRef.ИнвентаризацияОрдерногоСклада</v8:Type>
				<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
				<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
				<v8:Type>cfg:DocumentRef.ПеремещениеНезавершенногоПроизводства</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
				<v8:Type>cfg:DocumentRef.ПеремещениеДенежныхСредств</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
				<v8:Type>cfg:DocumentRef.Комплектация</v8:Type>
				<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПокупателя</v8:Type>
				<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
				<v8:Type>cfg:DocumentRef.РабочийЛистОтделаСтрахования</v8:Type>
				<v8:Type>cfg:DocumentRef.ПереразмещениеАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ИзвлечениеТоваровИзПроизводства</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыДвигателей</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказПоставщикуНаАвтомобиль</v8:Type>
				<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначимыеСобытия</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
				<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
				<v8:Type>cfg:DocumentRef.РасходныйСкладскойОрдерНаАвтомобили</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыСалона</v8:Type>
				<v8:Type>cfg:DocumentRef.СписаниеАктивов</v8:Type>
				<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
				<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПоставщику</v8:Type>
				<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
				<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.ПереразмещениеТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
				<v8:Type>cfg:DocumentRef.РезервированиеЗаказовПокупателя</v8:Type>
				<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
				<v8:Type>cfg:DocumentRef.ПланФакт</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетОтПоставщика</v8:Type>
				<v8:Type>cfg:DocumentRef.ИзменениеЦен</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
				<v8:Type>cfg:CatalogRef.КассыКомпании</v8:Type>
				<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
				<v8:Type>cfg:DocumentRef.СтраховойПолис</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводВЭксплуатацию</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводОстатковТоваровВПроизводстве</v8:Type>
				<v8:Type>cfg:DocumentRef.ВозвратОтПокупателяАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.Чек</v8:Type>
				<v8:Type>cfg:DocumentRef.ОбслуживаниеАктива</v8:Type>
				<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
				<v8:Type>cfg:DocumentRef.Переоценка</v8:Type>
				<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
				<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
				<v8:Type>cfg:DocumentRef.РасходныйСкладскойОрдер</v8:Type>
				<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
				<v8:Type>cfg:DocumentRef.Амортизация</v8:Type>
				<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
				<v8:Type>cfg:DocumentRef.БТ_Телемаркетинг</v8:Type>
				<v8:Type>cfg:DocumentRef.СнятиеРезервовЗаказовПокупателя</v8:Type>
				<v8:Type>cfg:DocumentRef.КорректировкаРеализацииАвтомобилей</v8:Type>
				<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
				<v8:Type>cfg:DocumentRef.Событие</v8:Type>
				<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
				<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
				<v8:Type>cfg:DocumentRef.ИнвентаризацияАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ПеремещениеАктивов</v8:Type>
				<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
				<v8:Type>cfg:DocumentRef.КорректировкаПоступленияАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ПереоценкаАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ПеремещениеТоваровВПроизводство</v8:Type>
				<v8:Type>cfg:DocumentRef.ВводВЭксплуатациюАвтомобилей</v8:Type>
				<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
				<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
				<v8:Type>cfg:DocumentRef.ПриходныйСкладскойОрдер</v8:Type>
				<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыКПП</v8:Type>
				<v8:Type>cfg:DocumentRef.ИзменениеЦенАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
				<v8:Type>cfg:DocumentRef.РезервированиеАвтомобилей</v8:Type>
				<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
				<v8:Type>cfg:DocumentRef.Инкассация</v8:Type>
				<v8:Type>cfg:DocumentRef.СчетОтПоставщикаЗаАвтомобили</v8:Type>
				<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
				<v8:Type>cfg:DocumentRef.ПриходныйСкладскойОрдерНаАвтомобили</v8:Type>
				<v8:Type>cfg:DocumentRef.ОтчетКомитентуЗаАвтомобили</v8:Type>
			</Type>
			<Hierarchical>true</Hierarchical>
			<BasedOn>
				<xr:Item>ChartOfCharacteristicTypes.НазначенияСвойствОбъектов</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазовоеНазначение</Name>
					<Comment>Ссылка на предопределенное назначение, определяющее набор свойств вида объекта. Используется для свойств конкретных объектов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НазначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, для которого назначаются виды свойств</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыСвойств</Name>
					<Comment>Список видов свойств, назначаемых для объекта или определяемого типа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Вид свойства, назначаемый объекту</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/ChartsOfCharacteristicTypes/НазначенияСвойствОбъектов/Ext/ManagerModule.bsl
// Заполняет предопределенные элементы
//
// Без параметров
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	// Получим макет настроек по умолчанию
	Макет = ПланыВидовХарактеристик.НазначенияСвойствОбъектов.ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		Сообщить("Не обнаружен макет начальных настроек!");
		Возврат;
	КонецЕсли;
	
	ТекНазначение = Неопределено; ТекНазначениеИмя = "";
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		СтрокаНазначение = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрокаСвойство   = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		// Если виды свойств задаются раньше назначений или это пустая строка, то продолжаем поиск назначения свойства
		Если ПустаяСтрока(СтрокаНазначение) И ПустаяСтрока(СтрокаСвойство) Тогда Продолжить; КонецЕсли;
		Если ПустаяСтрока(СтрокаНазначение) И НЕ ПустаяСтрока(СтрокаСвойство) И ТекНазначение = Неопределено Тогда Продолжить; КонецЕсли; 
		Если НЕ ПустаяСтрока(СтрокаНазначение) Тогда // Это назначение свойства
			Если ТекНазначение <> Неопределено Тогда
				Если ТекНазначениеИмя <> СтрокаНазначение Тогда //Запишем предыдущий элемент со всеми его свойствами
					ТекНазначение.Записать();
					ТекНазначение = Неопределено;
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			// Нам встретилось новое назначение свойств. Найдем ссылку на предопределенный элемент ПВХ "Назначения свойств"
			Попытка
				СсылкаНаНазначение = ПланыВидовХарактеристик.НазначенияСвойствОбъектов[СтрокаНазначение];
				ТекНазначение    = СсылкаНаНазначение.ПолучитьОбъект();
				ТекНазначениеИмя = СтрокаНазначение;  
			Исключение
				Сообщить("Ошибка при заполнении назначения свойства: '" + СтрокаНазначение + "'. Указан отсутствующий элемент ПВХ Назначения свойств объектов!");
				ТекНазначение = Неопределено	
			КонецПопытки;
		Иначе	
			Попытка
				СсылкаНаСвойство = ПланыВидовХарактеристик.СвойстваОбъектов[СтрокаСвойство];				
				Если ТекНазначение.ВидыСвойств.Найти(СсылкаНаСвойство,"Свойство")= Неопределено Тогда
					СтрокаВидыСвойств = ТекНазначение.ВидыСвойств.Добавить();
					СтрокаВидыСвойств.Свойство = СсылкаНаСвойство
				КонецЕсли;
			Исключение
				Сообщить("Ошибка при заполнении назначения свойства: '" + ТекНазначениеИмя + "'. Указан отсутствующий элемент ПВХ Свойства объектов: '"+СтрокаСвойство+"'!");
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	Попытка
		ТекНазначение.Записать()
	Исключение	
	КонецПопытки
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
